# case study on attritution

In [1]:
url = "https://raw.githubusercontent.com/dupadhyaya/hrAnalytics/main/data/attrition/HR_attr1.csv"

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv(url)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   salary                 14999 non-null  object
 8   left                   14999 non-null  int64
dtypes: float64(2), int64(6), object(1)
memory usage: 1.0+ MB

In [4]:
df.shape

(14999, 9)

In [5]:
df.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident',
       'promotion_last_5years', 'salary', 'left'],
      dtype='object')

In [6]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,salary,left
0,0.38,0.53,2,157,3,0,0,low,1
1,0.80,0.86,5,262,6,0,0,medium,1
2,0.11,0.88,7,272,4,0,0,medium,1
3,0.72,0.87,5,223,5,0,0,low,1
4,0.37,0.52,2,159,3,0,0,low,1

In [7]:
df.left.value_counts()

left
0    11428
1     3571
Name: count, dtype: int64

In [16]:
df.left.value_counts(normalize=True,sort=True, ascending=False)

left
0    0.761917
1    0.238083
Name: proportion, dtype: float64

In [12]:
3571/15000

0.23806666666666668

In [8]:
df.groupby('left').size()

left
0    11428
1     3571
dtype: int64

In [10]:
df.groupby('left')['left'].agg('count')

left
0    11428
1     3571
Name: left, dtype: int64

In [17]:
df.salary.value_counts()

salary
low       7316
medium    6446
high      1237
Name: count, dtype: int64

In [20]:
df.salary.value_counts(ascending=False)

salary
low       7316
medium    6446
high      1237
Name: count, dtype: int64

In [22]:
df.salary.value_counts(normalize=True,sort=True, ascending=True)

salary
high      0.082472
medium    0.429762
low       0.487766
Name: proportion, dtype: float64

In [23]:
df.describe()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,left
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.021268,0.238083
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.144281,0.425924
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [24]:
df.dtypes

satisfaction_level       float64
last_evaluation          float64
number_project             int64
average_montly_hours       int64
time_spend_company         int64
Work_accident              int64
promotion_last_5years      int64
salary                    object
left                       int64
dtype: object

In [27]:
df[['satisfaction_level','time_spend_company']].mean()

satisfaction_level    0.612834
time_spend_company    3.498233
dtype: float64

In [30]:
df.select_dtypes('number').mean()

satisfaction_level         0.612834
last_evaluation            0.716102
number_project             3.803054
average_montly_hours     201.050337
time_spend_company         3.498233
Work_accident              0.144610
promotion_last_5years      0.021268
left                       0.238083
dtype: float64

In [32]:
df.select_dtypes('number').agg(['mean','min','max'])

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,left
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.14461,0.021268,0.238083
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.00000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.00000,1.000000,1.000000

In [44]:
df.groupby('salary').agg(meanSatLevel = ('satisfaction_level','mean'), promL5Y =('promotion_last_5years', 'sum'))

        meanSatLevel  promL5Y
salary
high        0.637470       72
low         0.600753       66
medium      0.621817      181

In [38]:
df['promotion_last_5years'].value_counts()

promotion_last_5years
0    14680
1      319
Name: count, dtype: int64

In [50]:
df.groupby('salary').agg(count = ('salary','count'), meanSatLevel = ('satisfaction_level','mean'), promL5Y =('promotion_last_5years', 'sum'))

        count  meanSatLevel  promL5Y
salary
high     1237      0.637470       72
low      7316      0.600753       66
medium   6446      0.621817      181

AttributeError: 'DataFrame' object has no attribute 'colums'